[
    {
        "question_number": 2,
        "category": "both",
        "question": "In your world, which is more important on a scale of 1 to 10: Extreme health or extreme wealth?",
        "subquestions": ["Reflect on the significance of both health and wealth in your life and how they contribute to your overall well-being."]
    },
    {
        "question_number": 7,
        "category": "both",
        "question": "What specific aspects of your health and wealth would you prioritize addressing first?",
        "subquestions": ["Delve into the areas of your health and finances that require immediate attention and outline actionable steps to address them."]
    },
    {
        "question_number": 20,
        "category": "both",
        "question": "If you could give one piece of advice to your future self about prioritizing health and wealth, what would it be?",
        "subquestions": ["Imagine advising your future self and share a valuable insight or lesson learned about the importance of prioritizing health and wealth in life."]
    },
    {
        "question_number": 11,
        "category": "wealth",
        "question": "What does financial freedom mean to you, and how do you plan to achieve it?",
        "subquestions": ["Explore your definition of financial freedom and outline the steps you intend to take to attain it."]
    },
    {
        "question_number": 21,
        "category": "wealth",
        "question": "What are your long-term financial goals, and how do you plan to achieve them?",
        "subquestions": ["Define your aspirations for financial success and outline the steps required to realize your objectives."]
    },
    {
        "question_number": 25,
        "category": "wealth",
        "question": "In times of financial uncertainty, what steps do you take to maintain stability and adaptability in your financial planning?",
        "subquestions": ["Reflect on your resilience and ability to navigate economic fluctuations to ensure long-term financial well-being."]
    },
    {
        "question_number": 12,
        "category": "health",
        "question": "How do you prioritize self-care in your daily life, and what practices do you implement to maintain your well-being?",
        "subquestions": ["Reflect on the importance of self-care and identify the rituals or habits that contribute to your physical, mental, and emotional health."]
    },
    {
        "question_number": 31,
        "category": "health",
        "question": "How do you prioritize physical fitness in your daily routine, and what activities do you engage in to maintain a healthy lifestyle?",
        "subquestions": ["Discuss the importance of regular exercise and the types of physical activities you incorporate into your daily life."]
    },
    {
        "question_number": 32,
        "category": "health",
        "question": "What dietary habits do you prioritize to support your overall well-being, and how do they contribute to your health goals?",
        "subquestions": ["Explore your approach to nutrition and the dietary choices you make to promote optimal health and vitality."]
    }
]

